app/controllers/allotments_controller.rb

  def index
    @allotments = Allotment.all
---
SELECT * FROM `allotments`