app/controllers/bus_stops_controller.rb

SELECT * FROM `bus_stops` WHERE ((latitude < '53.480895' AND latitude > '53.358133') OR (longitude > '-2.477417' AND longitude < '-2.202759')) ORDER BY RAND() LIMIT 300
---
  def index
    respond_to do |format|
      format.html do
        @bus_stops = BusStop.all(:limit => '100', :order => RANDOM_TEXT)

SELECT * FROM `bus_stops` WHERE (`bus_stops`.`id` = 0)
---
  def show
    @bus_stop = BusStop.find(params[:id])

INSERT INTO `bus_stops` (`common_name`, `latitude`, `created_at`, `updated_at`, `longitude`, `locality_name`, `naptan_code`) VALUES('Altrincham Interchange', '53.3874', '2010-08-13 21:43:18', '2010-08-13 21:43:18', '-2.3477', 'Altrincham', 'manadadg')
---
  def import_data
    bus_stop_xml = File.read('public/busstops.xml')
    bus_stop_hash = Hash.from_xml(bus_stop_xml)
    logger.info("--- bus_stop_hash: #{bus_stop_hash['bus_stops']['bus_stop']}")
    bus_stop_hash['bus_stops']['bus_stop'].each do |tree|
      @bus_stop = BusStop.new()
      @bus_stop.naptan_code = tree['naptan_code']
      @bus_stop.common_name = tree['common_name']
      @bus_stop.locality_name = tree['locality_name']
      @bus_stop.longitude = tree['longitude']
      @bus_stop.latitude = tree['latitude']
      @bus_stop.save!