app/controllers/children_centres_controller.rb

  def index
    @children_centres = ChildrenCentre.all
---
SELECT * FROM `children_centres`

  def show
    @children_centre = ChildrenCentre.find(params[:id])
---
SELECT * FROM `children_centres` WHERE (`children_centres`.`id` = 0)

  def import_data
    children_centre_xml = File.read('public/childrenscentres.xml')
    children_centre_hash = Hash.from_xml(children_centre_xml)
    #logger.info("--- children_centre_hash: #{children_centre_hash}")
    children_centre_hash['childrens_centres']['childrens_centre'].each do |tree|
      @children_centre = ChildrenCentre.new()
      @children_centre.centre_id = tree['id']
      @children_centre.name = tree['name']
      @children_centre.centre_type = tree['type']
      @children_centre.location = tree['location']
      @children_centre.address = tree['address']
      @children_centre.town = tree['town']
      @children_centre.postcode = tree['postcode']
      @children_centre.telephone = tree['telephone']
      @children_centre.notes = tree['notes']
      @children_centre.longitude = tree['longitude']
      @children_centre.latitude = tree['latitude']
      @children_centre.save!
---
INSERT INTO `children_centres` (`name`, `address`, `centre_type`, `location`, `latitude`, `created_at`, `centre_id`, `postcode`, `notes`, `updated_at`, `telephone`, `longitude`, `town`) VALUES('Old Trafford Information Point', '463 Stretford Road', 'Information Point', 'Bright Horizons', '53.4647', '2010-08-13 20:29:56', 1, 'M16 9AB', NULL, '2010-08-13 20:29:56', '0161 912 5542', '-2.26244', 'Old Trafford')