app/controllers/everythings_controller.rb

  def index
    @allotments = Allotment.all
    @children_centres = ChildrenCentre.all
    @leisure_centres = LeisureCentre.all
    @libraries = Library.all
    @parks = Park.all
    @polling_stations = PollingStation.all
    @recycling_sites = RecyclingSite.all
    @schools = School.all
    @train_stations = TrainStation.all
    @trees = Tree.all(:limit => '100', :order => RANDOM_TEXT)
---
SELECT * FROM `allotments`
SELECT * FROM `children_centres`
SELECT * FROM `leisure_centres`
SELECT * FROM `libraries`
SELECT * FROM `parks`
SELECT * FROM `polling_stations`
SELECT * FROM `recycling_sites`
SELECT * FROM `schools`
SELECT * FROM `train_stations`
SELECT * FROM `trees` ORDER BY RAND() LIMIT 100