app/controllers/leisure_centres_controller.rb

SELECT * FROM `leisure_centres`
---
  def index
    @leisure_centres = LeisureCentre.all