app/controllers/parks_controller.rb

  def index
    @parks = Park.all
---
SELECT * FROM `parks`