app/controllers/polling_stations_controller.rb

  def index
    @polling_stations = PollingStation.all
---
SELECT * FROM `polling_stations`

  def show
    @polling_station = PollingStation.find(params[:id])
---
SELECT * FROM `polling_stations` WHERE (`polling_stations`.`id` = 0)

  def import_data
    polling_station_xml = File.read('public/pollingstations.xml')
    polling_station_hash = Hash.from_xml(polling_station_xml)
    #logger.info("--- polling_station_hash: #{polling_station_hash}")
    polling_station_hash['polling_stations']['polling_station'].each do |tree|
      @polling_station = PollingStation.new()
      @polling_station.ref = tree['ref']
      @polling_station.prefix = tree['prefix']
      @polling_station.ward_code = tree['ward_code']
      @polling_station.polling_district_code = tree['polling_district_code']
      @polling_station.ward_name = tree['ward_name']
      @polling_station.access = tree['access']
      @polling_station.availability = tree['availability']
      @polling_station.name = tree['name']
      @polling_station.longitude = tree['longitude']
      @polling_station.latitude = tree['latitude']
      @polling_station.save!
---
INSERT INTO `polling_stations` (`name`, `latitude`, `created_at`, `prefix`, `updated_at`, `polling_district_code`, `ward_name`, `availability`, `ward_code`, `ref`, `access`, `longitude`) VALUES('St George\'s Parish Hall', '53.3896', '2010-08-13 20:47:20', 1, '2010-08-13 20:47:20', 'A', 'Altrincham', 'YES', 'AL', '1ALA', 'Accessible', '-2.35219')