app/controllers/recycling_sites_controller.rb

  def index
    @recycling_sites = RecyclingSite.all
---
SELECT * FROM `recycling_sites` WHERE (facilities LIKE 'Paper')