app/controllers/schools_controller.rb

  def index
    @schools = School.all
---
SELECT * FROM `schools`