app/controllers/train_stations_controller.rb

  def index
    @train_stations = TrainStation.all
---
SELECT * FROM `train_stations`

  def import_data
    train_station_xml = File.read('public/trainstations.xml')
    train_station_hash = Hash.from_xml(train_station_xml)
    #logger.info("--- train_station_hash: #{train_station_hash}")
    train_station_hash['train_stations']['train_station'].each do |tree|
      @train_station = TrainStation.new()
      @train_station.crs_code = tree['crs_code']
      @train_station.name = tree['station_name']
      @train_station.longitude = tree['longitude']
      @train_station.latitude = tree['latitude']
      @train_station.save!
---
INSERT INTO `train_stations` (`name`, `crs_code`, `latitude`, `created_at`, `updated_at`, `longitude`) VALUES('Altrincham Rail Station', 'ALT', '53.3876', '2010-08-13 20:57:51', '2010-08-13 20:57:51', '-2.3471')