app/controllers/trees_controller.rb

SELECT * FROM `trees` WHERE ((latitude < '53.480895' AND latitude > '53.358133') OR (longitude > '-2.477417' AND longitude < '-2.202759')) ORDER BY RAND() LIMIT 500
---
  def index
    respond_to do |format|
      format.html do
        @trees = Tree.all(:limit => '100', :order => RANDOM_TEXT)